## This Notebook generates a CSV for Table 1a
The CSV has the structure of Table 1a, except for the Total row at the bottom. The presentation and the Total row as in the paper was done in another tool.

In [14]:
from pathlib import Path
import pandas as pd

In [15]:
# define data location constants
DATA_DIR = Path('..') / 'source_data'
WILD_FISH_DATA = DATA_DIR / 'all_wild_fish_lice.csv'
WILD_EVENT_DATA = DATA_DIR / 'all_wild_sample_events.csv'

OUTPUT_DIR = Path('..') / 'output' / 'Table_1a'

In [16]:
# import the data
events_df = pd.read_csv(WILD_EVENT_DATA)
fish_df = pd.read_csv(WILD_FISH_DATA)

# make a year column
events_df['sampledate'] = pd.to_datetime(events_df.sampledate)
events_df['year'] = events_df.sampledate.dt.year

## Calculate the "All Events" column

In [17]:
# group by year
events_year_group = events_df.groupby(['year'])

# get the number of sample events each year
num_events_df = events_year_group['event_id'].count().reset_index()
num_events_df.rename(columns={'event_id': 'All Events'}, inplace=True)
num_events_df.head()

   year  All Events
0  2001          16
1  2002          31
2  2003        1807
3  2004        1109
4  2005         969

## Calculate the "Events with Fish" column

In [18]:
# join events and fish data, merge 'right' to only include events that have fish
wild_with_fish_df = pd.merge(events_df, fish_df, how='right', on=['event_id'])

In [19]:
# get a row for each year-event_id combination
wild_with_fish_year_group = wild_with_fish_df.groupby(['year', 'event_id'])
num_events_with_fish_id_df = wild_with_fish_year_group['fish_id'].count().reset_index()
num_events_with_fish_id_df.head()

   year  event_id  fish_id
0  2001   65093.0       18
1  2001   65094.0       10
2  2001   65095.0       77
3  2001   65096.0       11
4  2001   65097.0       12

In [20]:
# group by year and count the unique event_id for each year
num_events_with_fish_group = num_events_with_fish_id_df.groupby('year')
num_events_with_fish_df = num_events_with_fish_group['event_id'].count().reset_index()
num_events_with_fish_df.rename(columns={'event_id': 'Events with fish'}, inplace=True)
num_events_with_fish_df.head()

   year  Events with fish
0  2001                16
1  2002                31
2  2003              1273
3  2004               799
4  2005               599

## Calculate numbers of fish caught each year

In [21]:
# merge events and fish with all the entries
all_events_fish_df = pd.merge(events_df, fish_df, how='left', on='event_id')
all_events_fish_df.head()

,event_id,sampledate,region,dfozone,sample_site,latitude,longitude,source,year,fish_id,...,lep_motile,lep_unknown,cal_cop,cal_chal,cal_motile,cal_unknown,unknown_cop,unknown_chal,unknown_motile,unknown_unknown
0,1.0,2003-05-13,Broughton Archipelago,3_3,Adeane Point,50.71978,-125.6795,Fisheries and Oceans Canada,2003,1715.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,1.0,2003-05-13,Broughton Archipelago,3_3,Adeane Point,50.71978,-125.6795,Fisheries and Oceans Canada,2003,1716.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,1.0,2003-05-13,Broughton Archipelago,3_3,Adeane Point,50.71978,-125.6795,Fisheries and Oceans Canada,2003,1717.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,1.0,2003-05-13,Broughton Archipelago,3_3,Adeane Point,50.71978,-125.6795,Fisheries and Oceans Canada,2003,1718.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,1.0,2003-05-13,Broughton Archipelago,3_3,Adeane Point,50.71978,-125.6795,Fisheries and Oceans Canada,2003,1719.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [22]:
# pivot and count to get counts of each species of fish each year
year_species_df = pd.pivot_table(all_events_fish_df, values='region', index='year', columns=['fish_species'],
                                    aggfunc='count', fill_value=0).reset_index()

year_species_df

fish_species,year,Chinook Salmon,Chum Salmon,Coho Salmon,Other Species,Pacific Herring,Pink Salmon,Sockeye Salmon,Three-Spined Stickleback
0,2001,0,0,0,0,0,268,0,0
1,2002,0,67,0,0,0,497,0,0
2,2003,1011,15484,2909,1614,828,10220,64,2886
3,2004,754,19698,104,1,93,3253,2,1479
4,2005,405,4955,128,1,0,6091,271,45
5,2006,214,14267,170,695,0,11355,9,10
6,2007,345,18770,165,1,0,13907,50,1350
7,2008,521,15785,190,0,0,20920,10,1601
8,2009,126,15699,136,65,6,16680,2,2567
9,2010,137,5991,226,0,0,7381,84,26
10,2011,181,8062,320,18,60,8017,1,55
11,2012,137,7841,330,0,0,6961,206,27
12,2013,18,3981,66,7,0,3694,26,0
13,2014,27,2908,58,1,1,3644,55,0
14,2015,129,2004,166,1,3,3310,59,24
15,2016,230,4795,249,25,0,3242,76,8
16,2017,37,7513,320,1,0,3180,165,11
17,2018,89,4535,135,3,0,3480,68,41
18,2019,59,5248,199,0,0,3015,27,104
19,2020,55,5068,269,1,5,4227,57,4
20,2021,105,6497,156,5,12,5355,42,189
21,2022,169,6983,302,1,0,4642,1,0
22,2023,25,2610,205,2,0,3068,70,0

## Calculate the total numbers of fish each year

In [23]:
# calculate total number of fish each year
total_fish_df = all_events_fish_df.groupby('year')['fish_id'].count().reset_index()
total_fish_df.head(10)

   year  fish_id
0  2001      268
1  2002      564
2  2003    35016
3  2004    25384
4  2005    11896
5  2006    26720
6  2007    34588
7  2008    39027
8  2009    35281
9  2010    13845

## Merge all the results into the final table

In [27]:
# counts of all the events and events with fish each year
table_1a_df = pd.merge(num_events_df, num_events_with_fish_df, on='year', how='left')
# add in the counts of species each year
table_1a_df = pd.merge(table_1a_df, year_species_df, on='year', how='left')
# add the total number of fish
table_1a_df = pd.merge(table_1a_df, total_fish_df, on='year', how='left')
table_1a_df.head(10)

,year,All Events,Events with fish,Chinook Salmon,Chum Salmon,Coho Salmon,Other Species,Pacific Herring,Pink Salmon,Sockeye Salmon,Three-Spined Stickleback,fish_id
0,2001,16,16,0,0,0,0,0,268,0,0,268
1,2002,31,31,0,67,0,0,0,497,0,0,564
2,2003,1807,1273,1011,15484,2909,1614,828,10220,64,2886,35016
3,2004,1109,799,754,19698,104,1,93,3253,2,1479,25384
4,2005,969,599,405,4955,128,1,0,6091,271,45,11896
5,2006,1098,707,214,14267,170,695,0,11355,9,10,26720
6,2007,1127,943,345,18770,165,1,0,13907,50,1350,34588
7,2008,1214,953,521,15785,190,0,0,20920,10,1601,39027
8,2009,1168,960,126,15699,136,65,6,16680,2,2567,35281
9,2010,732,603,137,5991,226,0,0,7381,84,26,13845

In [28]:
# rename columns nicely for publication
table_1a_df.rename(
    columns={'year': 'Year', 'All Events': 'All events',
             'Chum Salmon': 'Chum', 'Pink Salmon': 'Pink', 'Coho Salmon': 'Coho', 'Chinook Salmon': 'Chinook',
             'Sockeye Salmon': 'Sockeye', 'Three-Spined Stickleback': 'Stickleback', 'Other Species': 'Other species',
             'fish_id': 'All fish'},
    inplace=True
)

# order the columns
col_order = ['Year', 'All events', 'Events with fish','Chum','Pink', 'Coho', 'Chinook', 'Sockeye',
             'Stickleback', 'Pacific Herring', 'Other species', 'All fish']
table_1a_df = table_1a_df.reindex(columns=col_order)
table_1a_df

,Year,All events,Events with fish,Chum,Pink,Coho,Chinook,Sockeye,Stickleback,Pacific Herring,Other species,All fish
0,2001,16,16,0,268,0,0,0,0,0,0,268
1,2002,31,31,67,497,0,0,0,0,0,0,564
2,2003,1807,1273,15484,10220,2909,1011,64,2886,828,1614,35016
3,2004,1109,799,19698,3253,104,754,2,1479,93,1,25384
4,2005,969,599,4955,6091,128,405,271,45,0,1,11896
5,2006,1098,707,14267,11355,170,214,9,10,0,695,26720
6,2007,1127,943,18770,13907,165,345,50,1350,0,1,34588
7,2008,1214,953,15785,20920,190,521,10,1601,0,0,39027
8,2009,1168,960,15699,16680,136,126,2,2567,6,65,35281
9,2010,732,603,5991,7381,226,137,84,26,0,0,13845
10,2011,852,669,8062,8017,320,181,1,55,60,18,16714
11,2012,543,491,7841,6961,330,137,206,27,0,0,15502
12,2013,225,215,3981,3694,66,18,26,0,0,7,7792
13,2014,191,179,2908,3644,58,27,55,0,1,1,6694
14,2015,196,164,2004,3310,166,129,59,24,3,1,5696
15,2016,377,274,4795,3242,249,230,76,8,0,25,8625
16,2017,473,405,7513,3180,320,37,165,11,0,1,11227
17,2018,463,343,4535,3480,135,89,68,41,0,3,8351
18,2019,612,348,5248,3015,199,59,27,104,0,0,8652
19,2020,642,423,5068,4227,269,55,57,4,5,1,9686
20,2021,737,534,6497,5355,156,105,42,189,12,5,12361
21,2022,728,499,6983,4642,302,169,1,0,0,1,12098
22,2023,506,292,2610,3068,205,25,70,0,0,2,5980

In [29]:
# export the table to a CSV for final formatting
table_1a_df.to_csv(OUTPUT_DIR / "Table_1a.csv", index=False)